Tekla Open API Reference for Tekla Structures 2025
Plugin Properties
The Plugin type exposes the following members.
Properties
Name | Description
Attributes
 Gets or sets the attributes of the current object. Only attributes of the same type as the object are allowed.
 (Inherited from DrawingObject.)
Name
 Gets the name of the plug-in.
QueryReturnValue
 Status information about the latest database operation (select, insert, modify, delete).
 (Inherited from DatabaseObject.)
Top
See Also
Reference
Plugin Class
Tekla.Structures.Drawing Namespace